cases/chpt4-bis-Init/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application             gtawFoam;

startFrom               latestTime;

startTime               latestTime;//0;

stopAt                  endTime;

endTime                 10000;//240;//1020; // 20 mins

deltaT                  1e-3;

writeControl            adjustableRunTime;

writeInterval           100;

purgeWrite              0;

writeFormat             ascii;

writePrecision          6;

writeCompression        off;

timeFormat              general;

runTimeModifiable       yes;

adjustTimeStep          on;

maxCo                   0.5;//5;

maxAlphaCo      0.5;

maxDeltaT       0.5;
/*
functions
{
  probes
  {
      type          probes;
      libs          ("libsampling.so");
      writeControl  timeStep;
      writeInterval 1;  
      
      fields
      (
        cpLiquidField
      );

      probeLocations
      (
        (0 0 0)
      );
  }
*/
/*
    #includeFunc  probes

    fieldAverage1
    {
        type            fieldAverage;
        libs            ("libfieldFunctionObjects.so");
//        libs            ("libfieldAverage.so");
        writeControl    writeTime;
        fields
        (
            cpLiquidField
            {
                 mean        on;
                 prime2Mean  off;
                 base        time;
            }
        );
    }
}
*/

libs (
    "libdynamicFvMeshUser.so"
"libOpenFOAM.so"
"libsimpleSwakFunctionObjects.so"
"libswakFunctionObjects.so"
"libgroovyBC.so"
      );
//"libimmiscibleIncompressibleWeldPhaseMixture.so"

// ************************************************************************* //
